app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ('first article', 'description of first article', '2025-07-25 21:49:21.941427', '2025-07-25 21:49:21.941427') RETURNING "id"
---
  def create
    @article = Article.new(article_params)
    @article.save
    redirect_to @article
    if @article.save